---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalService.IExternalService
source: html/073dc67f-dcc1-af49-7bb4-db2146b2c7db.htm
---
# IExternalService Methods

Implement this method to execute the given server.